# ViewNode Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ViewNode Methods
ViewNode Class See Also
---
The ViewNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from RenderNode.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetCameraInfo | Information about the observation point (the camera) of the view. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ViewNode Class
Autodesk.Revit.DB Namespace